twilio/app/controllers/phone_numbers_controller.rb

	def create
	  @phone_number = PhoneNumber.find_or_create_by(phone_number: params[:phone_number][:phone_number])
---
INSERT INTO "phone_numbers" ("phone_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["phone_number", "5166607230"], ["created_at", "2016-05-18 17:53:48.421329"], ["updated_at", "2016-05-18 17:53:48.421329"]]
SELECT  "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."phone_number" = ? LIMIT 1  [["phone_number", "5166607230"]]

	def verify
 	@phone_number = PhoneNumber.find_by(phone_number: params[:hidden_phone_number])
---
SELECT  "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."phone_number" = ? LIMIT 1  [["phone_number", ""]]